{"posted_ids": {"ce4860e2639fb9f56b7a1dd3b6f51c22": 1769527449, "05dbe9f2e327b44defc3099c4c983550": 1769527456, "1fa259ac97cc913f4f9ed62994b42429": 1769527462, "48e2921adb71b0a7d109742b763b211e": 1769527506, "b1c3970fd42e4cfffecd7b05ecd6bab6": 1769538509, "719239e3221a3e76e5c2a617a261e1d0": 1769581594, "ec68d093efd8c27062e86b54e8b09fa6": 1769603588, "76143a69677c292de741fd188e68edfb": 1769613895, "67a5482aee878927e4f5a41c9cf4a953": 1769613897, "1ea89843d0f60649c8318b8bbedba619": 1769613903, "a399c38ee12638b53e6a967294698899": 1769624878, "9b5b343e667526a31963ee7ed03f89f1": 1769624880, "142a06ca71886dcdec8d4e664321591a": 1769624885, "598dddf8979263e19f2d2ab62b0729d8": 1769668618, "83a3d2eea907112506059e6a479c884c": 1769668620, "47049a7169772dd6a23256ccf18b9e70": 1769668625, "7cf0c429472b8d47cf2bb75256e0182e": 1769690289, "cdfb82517ad327c4ed338943e2a3c2ea": 1769690292, "cc7e68ec085e4fd9dafc1486f29adc64": 1769690295, "fd2d24ecbc14da1149cb2ee622f928ac": 1769690297, "047acea124a2a36615643fc16bd44a6c": 1769690301, "128e1916029ea42121f9de03067b30b2": 1769700508, "3a57914fc489383f10b1c7921acf11a7": 1769700508, "a8a7a761cd72e2732bd9e3c75c4a2acc": 1769711628, "e2f2f910ef5bf8f62421bfeb16de2098": 1769755080, "3e69853834072bcbf755d4506f2bcfcd": 1769755083, "a78c12c954e3e223daa82034bd99a976": 1769776601, "ca5efb011ebb45ce9ed9d5aad30ea99a": 1769776605, "a47478f30bce5b93eca78360855f1a33": 1769786795, "96f240655017bfaff61df3141882d54d": 1769786798, "5344c754a040d1dc426908ac1a410d71": 1769797893, "bd2c6f7814ae9945809f492e65b3451a": 1769840953, "67a8944a115c0d10f4548552f26db30c": 1769840956, "d54683fb31f21455aa9f98f4b6abbbf0": 1769840960, "44956c1d55aedbdc79e99f93c141e04b": 1769862619, "4e5aafbbe722acf270bcad99c4529914": 1769862623, "09af623b3a6c7cf5b83aae1b420adf42": 1769872534, "97d198348592881398caec164087bd55": 1769872536, "1ecd28fec324c67a453ab6c50c1e0e0f": 1769872539, "9796ef12ac8049681fc26a979af0820c": 1769872543, "2362d7e10808bbfa568f02ff596837ad": 1769883705, "c152667af665bc84f8972627b05d9278": 1769883706, "f1e26154f3b61efd4a4f1701e0199256": 1769928013, "cde6d7960874cc94d7a6ea6397e60154": 1769928017, "ac930f4c74bb9b93fce6b882525c5c21": 1769949096, "7233f8ca020b5b10e654b217b8fe8de1": 1769959045, "7eb3653c61d1b90503c3d0186b2d71b8": 1769959046, "bbb83ad0dd8b0ef6e5dcd8a442b13a9b": 1769970247, "6b49ed4eb774eae5dbad05546e62552a": 1769970247, "f30f2fb9e0fcb57533ce9ac97f535e1f": 1769970248, "167646e7c8eb392d72c703eeed7ec9ca": 1770015260, "abfbf50d6139f91d5107fb23a809af13": 1770035964, "559283a743596c82cea1e1631f5eec0e": 1770046339, "5fd6abc622fb6bd04a19d272572139fe": 1770046343, "bbe66efb3e506a21119d72ee7802192f": 1770057197, "e51a60d75077866cb93d6ff5a8c4a509": 1770057199, "add905ee84c780931a0d364ed4f352e4": 1770100824, "d3572663efdcd5c9fc62380fd904b1e6": 1770122418, "3970df41d90910e8b56794d2942fc6f5": 1770122418, "a1eab9f1be7120be6e69197bf69bf42f": 1770122420, "0ec1d878d214bde65df5afc3648ddcb5": 1770133308, "445f200c30576d590d846da626a6c013": 1770144286, "5b1246e671a4822f8264b44c26c3bbbf": 1770144289, "951d3d1ffb2192a51c672f4bbb5c9eb0": 1770187240, "885e2ce20812b8538f9d8885d6e6536e": 1770187242, "65ecc9221af521d544aa3749af461921": 1770208821, "60a2ba6b213146a8148183770646d83f": 1770219342, "d244595fb8a7945c65ba540544a1d549": 1770219345, "037f4cf279055f454ecea7c2328085f4": 1770230304, "da44eae3318d04a81847b750abedc0f5": 1770230306, "03b82920a9103017699f4f27b4578d12": 1770274076, "b6bfcc5bf6137e334a4ef4f8904283f7": 1770274076, "ea4ae26181435f0810fdc658b1067b76": 1770274080, "7adde96a4f4cd311bb518bbe0edb25cc": 1770295324, "445b456cf9e297631d49dac1ea54d869": 1770295326}, "recent_titles": ["ESET Research: Sandworm behind cyberattack on Poland’s power grid in late 2025", "Four arrested in crackdown on Discord-based SWATting and doxing", "AIs are Getting Better at Finding and Exploiting Internet Vulnerabilities", "If you don’t control your keys, you don’t control your data", "Operation Winter SHIELD: FBI Issues Call to Arms for Organizations to Improve Cybersecurity", "In Other News: Paid for Being Jailed, Google’s $68M Settlement, CISA Chief’s ChatGPT Leak", "WhatsApp rolls out new protections against advanced exploits and spyware", "This startup aims to solve crypto’s broken key management problem", "The AI Fix #85: ChatGPT gets ads, pets get AI therapists, and everyone’s wrong about LLMs", "Meta confirms it’s working on premium subscription for its apps", "Second Round of Critical RCE Bugs in n8n Spikes Corporate Risk", "Mandiant details how ShinyHunters abuse SSO to steal cloud data", "Researcher reveals evidence of private Instagram profiles leaking photos", "Microsoft links Windows 11 boot failures to failed December 2025 update", "Hugging Face abused to spread thousands of Android malware variants", "Microsoft to disable NTLM by default in future Windows releases", "Iran-Linked RedKitten Cyber Campaign Targets Human Rights NGOs and Activists", "Malicious Chrome extensions can spy on your ChatGPT chats", "Ransomware Victim Numbers Rise, Despite Drop in Active Extortion Groups", "Lawmakers wonder when Trump administration will weigh on soon-expired surveillance powers", "Mandiant Finds ShinyHunters-Style Vishing Attacks Stealing MFA to Breach SaaS Platforms", "SmarterMail Fixes Critical Unauthenticated RCE Flaw with CVSS 9.3 Score", "White House Scraps ‘Burdensome’ Software Security Rules", "AI jailbreaking via poetry: bypassing chatbot defenses with rhyme | Kaspersky official blog", "From Quantum to AI Risks: Preparing for Cybersecurity's Future", "Privileged File System Vulnerability Present in a SCADA System", "Securing Vibe Coding Tools: Scaling Productivity Without Scaling Risk", "The $0 Transaction That Signaled a Nation-State Cyberattack", "3 security gadgets I never leave home without (and they're more affordable than you'd think)", "Аgentic AI security measures based on the OWASP ASI Top 10", "Notepad++ Update Hijacking Linked to Hosting Provider Compromise", "Most Parked Domains Now Serving Malicious Content", "This month in security with Tony Anscombe – January 2026 edition", "Threat and Vulnerability Management in 2026", "Hacking attack leaves Russian car owners locked out of their vehicles", "Malicious MoltBot skills used to push password-stealing malware", "Iron Mountain: Data breach mostly limited to marketing materials", "Hackers exploit critical React Native Metro bug to breach dev systems", "Critical React Native Vulnerability Exploited in the Wild", "How fake party invitations are being used to install remote access tools", "8-Minute Access: AI Accelerates Breach of AWS Environment", "Russian Hackers Weaponize Microsoft Office Bug in Just 3 Days", "Microsoft Warns Python Infostealers Target macOS via Fake Ads and Installers", "Fake apps, NFC skimming attacks, and other Android issues in 2026 | Kaspersky official blog", "Researchers Warn of New “Vect” RaaS Variant", "Hackers compromise NGINX servers to redirect user traffic", "Critical n8n flaws disclosed along with public exploits", "CISA: VMware ESXi flaw now exploited in ransomware attacks", "GRU-Linked BlueDelta Evolves Credential Harvesting", "Google’s disruption rips millions out of devices out of malicious network"], "recent_posts": [{"title": "Mandiant Finds ShinyHunters-Style Vishing Attacks Stealing MFA to Breach SaaS Platforms", "text": "Google-owned Mandiant on Friday said it identified an \"expansion in threat activity\" that uses tradecraft consistent with extortion-themed attacks orchestrated by a financially motivated hacking group known as ShinyHunters. The attacks leverage advanced voice phishing (aka vishing) and bogus credential harvesting sites mimicking targeted companies to gain unauthorized access to victim ", "topic": "phishing", "time": 1769959045}, {"title": "SmarterMail Fixes Critical Unauthenticated RCE Flaw with CVSS 9.3 Score", "text": "SmarterTools has addressed two more security flaws in SmarterMail email software, including one critical security flaw that could result in arbitrary code execution. The vulnerability, tracked as CVE-2026-24423, carries a CVSS score of 9.3 out of 10.0. \"SmarterTools SmarterMail versions prior to build 9511 contain an unauthenticated remote code execution vulnerability in the ConnectToHub API ", "topic": "vulnerability", "time": 1769959046}, {"title": "White House Scraps ‘Burdensome’ Software Security Rules", "text": "Two Biden-era memorandums have been revoked, but some of the resources they provide can still be used by government organizations. The post White House Scraps ‘Burdensome’ Software Security Rules appeared first on SecurityWeek . ", "topic": "general", "time": 1769970247}, {"title": "AI jailbreaking via poetry: bypassing chatbot defenses with rhyme | Kaspersky official blog", "text": "A new study shows that verse-based prompts can slash the effectiveness of AI safety constraints. We’re breaking down an experiment involving 25 language models and its key takeaways. Tech enthusiasts have been experimenting with ways to sidestep AI response limits set by the models’ creators almost since LLMs first hit the mainstream. Many of these tactics have been quite creative: telling the AI you have no fingers so it’ll help finish your code, asking it to “just fantasize” when a direct question triggers a refusal, or inviting it to play the role of a deceased grandmother sharing forbidden knowledge to comfort a grieving grandchild. Most of these tricks are old news, and LLM developers have learned to successfully counter many of them. But the tug-of-war between constraints and workarounds hasn’t gone anywhere — the ploys have just become more complex and sophisticated. Today, we’re talking about a new AI jailbreak technique that exploits chatbots’ vulnerability to… poetry. Yes, yo", "topic": "phishing", "time": 1769970247}, {"title": "From Quantum to AI Risks: Preparing for Cybersecurity's Future", "text": "In the latest edition of \"Reporters' Notebook,\" a trio of journalists urge the cybersecurity industry to prioritize patching vulnerabilities, preparing for quantum threats, and refining AI applications, ", "topic": "patch", "time": 1769970248}, {"title": "Privileged File System Vulnerability Present in a SCADA System", "text": "We detail our discovery of CVE-2025-0921. This privileged file system flaw in SCADA system Iconics Suite could lead to a denial-of-service (DoS) attack. The post Privileged File System Vulnerability Present in a SCADA System appeared first on Unit 42 . ", "topic": "vulnerability", "time": 1770015260}, {"title": "Securing Vibe Coding Tools: Scaling Productivity Without Scaling Risk", "text": "AI-generated code looks flawless until it isn't. Unit 42 breaks down how to expose these invisible flaws before they turn into your next breach. The post Securing Vibe Coding Tools: Scaling Productivity Without Scaling Risk appeared first on Unit 42 . ", "topic": "general", "time": 1770035964}, {"title": "The $0 Transaction That Signaled a Nation-State Cyberattack", "text": "A $0 card test signaled a Chinese state-linked cyberattack on Anthropic’s AI platform. Learn how card-testing fraud intelligence spots nation-state ops early. Key Points: Fraud enables cyber operations: Threat actors used compromised payment cards validated through Chinese-operated card-testing services to attempt unauthorized access to Anthropic's AI platform during a reported state-sponsored espionage campaign. Card testing signals downstream attacks: The observed fraud followed a predictable kill chain—compromise, validation, resale, and attempted cashout—providing early warning indicators that preceded the final malicious transaction. Recorded Future’s take: Proactive fraud intelligence prevents broader threats. Tester merchant intelligence can identify compromised cards before they're used for high-value fraud or to support advanced threat actor operations.", "topic": "apt", "time": 1770046339}, {"title": "3 security gadgets I never leave home without (and they're more affordable than you'd think)", "text": "These must-have tools help protect against hacking and data loss, without costing an arm and a leg. ", "topic": "general", "time": 1770046343}, {"title": "Аgentic AI security measures based on the OWASP ASI Top 10", "text": "Key security controls to implement in your organization to protect against malicious AI agent behavior. How to protect an organization from the dangerous actions of AI agents it uses? This isn’t just a theoretical what-if anymore — considering the actual damage autonomous AI can do ranges from providing poor customer service to destroying corporate primary databases . It’s a question business leaders are currently hammering away at, and government agencies and security experts are racing to provide answers to. For CIOs and CISOs, AI agents create a massive governance headache. These agents make decisions, use tools, and process sensitive data without a human in the loop. Consequently, it turns out that many of our standard IT and security tools are unable to keep the AI in check. The non-profit OWASP Foundation has released a handy playbook on this very topic. Their comprehensive Top 10 risk list for agentic AI applications covers everything from old-school security threats like privil", "topic": "phishing", "time": 1770057197}, {"title": "Notepad++ Update Hijacking Linked to Hosting Provider Compromise", "text": "A supply chain attack on Notepad++ update process was linked to compromised hosting infrastructure ", "topic": "patch", "time": 1770057199}, {"title": "Most Parked Domains Now Serving Malicious Content", "text": "Direct navigation -- the act of visiting a website by manually typing a domain name in a web browser -- has never been riskier: A new study finds the vast majority of \"parked\" domains -- mostly expired or dormant domain names, or common misspellings of popular websites -- are now configured to redirect visitors to sites that foist scams and malware. Direct navigation — the act of visiting a website by manually typing a domain name in a web browser — has never been riskier: A new study finds the vast majority of “parked” domains — mostly expired or dormant domain names, or common misspellings of popular websites — are now configured to redirect visitors to sites that foist scams and malware. A lookalike domain to the FBI Internet Crime Complaint Center website, returned a non-threatening parking page (left) whereas a mobile user was instantly directed to deceptive content in October 2025 (right). Image: Infoblox. When Internet users try to visit expired domain names or accidentally navi", "topic": "phishing", "time": 1770100824}, {"title": "This month in security with Tony Anscombe – January 2026 edition", "text": "The trends from January offer useful clues about the risks and priorities that security teams are likely to contend with throughout the year ", "topic": "general", "time": 1770122418}, {"title": "Threat and Vulnerability Management in 2026", "text": "Understand the future of threat and vulnerability management (TVM). Learn what TVM is, why traditional tools fail, and how intelligence is essential in today’s landscape. Key Takeaways: Traditional vulnerability management tools can no longer keep up with the speed of modern exploitation—threat context is now mandatory. Threat and Vulnerability Management (TVM) systems unify asset discovery, vulnerability data, and real-time external threat intelligence to prioritize real risk. Static CVSS scores fail to reflect exploitation likelihood ; intelligence-driven, dynamic risk scoring is essential in 2026. Organizations that integrate vulnerability intelligence and attack surface intelligence reduce remediation time and security waste , enhancing detection and remediation while reducing alert fatigue. Why Threat and Vulnerability Management Must Evolve in 2026 Security teams currently find themselves at a crossroads. Year over year, CVE volumes continue to surge higher and higher. Exploitati", "topic": "ransomware", "time": 1770122418}, {"title": "Hacking attack leaves Russian car owners locked out of their vehicles", "text": "Imagine the scene. It's a cold Monday morning in Moscow. You walk out to your car, coffee in hand, ready to face the day. You press the button to unlock your car, and ... nothing happens. You try again. Still nothing. The alarm starts blaring. You can't turn it off. Read more in my article on the Fortra blog. ", "topic": "general", "time": 1770122420}, {"title": "Malicious MoltBot skills used to push password-stealing malware", "text": "More than 230 malicious packages for the personal AI assistant OpenClaw (formerly known as Moltbot and ClawdBot) have been published in less than a week on the tool's official registry and on GitHub. [...] ", "topic": "general", "time": 1770133308}, {"title": "Iron Mountain: Data breach mostly limited to marketing materials", "text": "Iron Mountain, a leading data storage and recovery services company, says that a recent breach claimed by the Everest extortion gang is limited to mostly marketing materials. [...] ", "topic": "breach", "time": 1770144286}, {"title": "Hackers exploit critical React Native Metro bug to breach dev systems", "text": "Hackers are targeting developers by exploiting the critical vulnerability CVE-2025-11953 in the Metro server for React Native to deliver malicious payloads for Windows and Linux. [...] ", "topic": "vulnerability", "time": 1770144289}, {"title": "Critical React Native Vulnerability Exploited in the Wild", "text": "Albeit mainly considered a theoretical risk, the flaw has been exploited to disable protections and deliver malware. The post Critical React Native Vulnerability Exploited in the Wild appeared first on SecurityWeek . ", "topic": "general", "time": 1770187240}, {"title": "How fake party invitations are being used to install remote access tools", "text": "Fake party invitations are used to install remote access tools, so the criminals are the ones invited. “You’re invited!” It sounds friendly, familiar and quite harmless. But in a scam we recently spotted, that simple phrase is being used to trick victims into installing a full remote access tool on their Windows computers—giving attackers complete control of the system. What appears to be a casual party or event invitation leads to the silent installation of ScreenConnect , a legitimate remote support tool quietly installed in the background and abused by attackers. Here’s how the scam works, why it’s effective, and how to protect yourself. The email: A party invitation Victims receive an email framed as a personal invitation—often written to look like it came from a friend or acquaintance. The message is deliberately informal and social, lowering suspicion and encouraging quick action. In the screenshot below, the email arrived from a friend whose email account had been hacked, but it", "topic": "apt", "time": 1770187242}, {"title": "8-Minute Access: AI Accelerates Breach of AWS Environment", "text": "The AI-assisted attack, which started with exposed credentials from public S3 buckets, rapidly achieved administrative privilges. ", "topic": "phishing", "time": 1770208821}, {"title": "Russian Hackers Weaponize Microsoft Office Bug in Just 3 Days", "text": "APT28's attacks rely on specially crafted Microsoft Rich Text Format (RTF) documents to kick off a multistage infection chain to deliver malicious payloads. ", "topic": "apt", "time": 1770219342}, {"title": "Microsoft Warns Python Infostealers Target macOS via Fake Ads and Installers", "text": "Microsoft has warned that information-stealing attacks are \"rapidly expanding\" beyond Windows to target Apple macOS environments by leveraging cross-platform languages like Python and abusing trusted platforms for distribution at scale. The tech giant's Defender Security Research Team said it observed macOS-targeted infostealer campaigns using social engineering techniques such as ClickFix since ", "topic": "phishing", "time": 1770219345}, {"title": "Fake apps, NFC skimming attacks, and other Android issues in 2026 | Kaspersky official blog", "text": "How to safely use Android devices in the face of 2026’s new security threats The year 2025 saw a record-breaking number of attacks on Android devices. Scammers are currently riding a few major waves: the hype surrounding AI apps, the urge to bypass site blocks or age checks, the hunt for a bargain on a new smartphone, the ubiquity of mobile banking, and, of course, the popularity of NFC. Let’s break down the primary threats of 2025–2026, and figure out how to keep your Android device safe in this new landscape. Sideloading Malicious installation packages (APK files) have always been the Final Boss among Android threats, despite Google’s multi-year efforts to fortify the OS. By using sideloading — installing an app via an APK file instead of grabbing it from the official store — users can install pretty much anything, including straight-up malware. And neither the rollout of Google Play Protect, nor the various permission restrictions for shady apps have managed to put a dent in the sca", "topic": "phishing", "time": 1770230304}, {"title": "Researchers Warn of New “Vect” RaaS Variant", "text": "A new ransomware-as-a-service operation dubbed “Vect” features custom malware ", "topic": "ransomware", "time": 1770230306}, {"title": "Hackers compromise NGINX servers to redirect user traffic", "text": "A threat actor is compromising NGINX servers in a campaign that hijacks user traffic and reroutes it through the attacker's backend infrastructure. [...] ", "topic": "general", "time": 1770274076}, {"title": "Critical n8n flaws disclosed along with public exploits", "text": "Multiple critical vulnerabilities in the popular n8n open-source workflow automation platform allow escaping the confines of the environment and taking complete control of the host server. [...] ", "topic": "general", "time": 1770274076}, {"title": "CISA: VMware ESXi flaw now exploited in ransomware attacks", "text": "CISA confirmed on Wednesday that ransomware gangs have begun exploiting a high-severity VMware ESXi sandbox escape vulnerability that was previously used in zero-day attacks. [...] ", "topic": "ransomware", "time": 1770274080}, {"title": "GRU-Linked BlueDelta Evolves Credential Harvesting", "text": "Insikt Group reveals how GRU-linked BlueDelta evolved credential-harvesting campaigns targeting government, energy, and research organizations across Europe and Eurasia. The analysis cut-off date for this report was September 11, 2025 Executive Summary Between February and September 2025, Recorded Future’s Insikt Group identified multiple credential-harvesting campaigns conducted by BlueDelta, a Russian state-sponsored threat group associated with the Main Directorate of the General Staff of the Armed Forces of the Russian Federation (GRU). This activity represents an expansion of BlueDelta’s ongoing credential-theft operations previously detailed in Insikt Group’s December 2025 report . Insikt Group identified BlueDelta targeting a small but distinct set of victims during its 2025 credential-harvesting activity. Targets included individuals linked to a Turkish energy and nuclear research agency, as well as staff affiliated with a European think tank and organizations in North Macedoni", "topic": "apt", "time": 1770295324}, {"title": "Google’s disruption rips millions out of devices out of malicious network", "text": "The actions impaired some of IPIDEA’s proxy infrastructure, but not all of it. The effort underscores the back-and-forth struggle of taking out pieces of cybercriminals’ vast and growing infrastructure. The post Google’s disruption rips millions out of devices out of malicious network appeared first on CyberScoop . Millions of devices used as proxies by cybercriminals, espionage groups and data thieves have been removed from circulation following Google’s disruption of IPIDEA, a China-based residential proxy network. The reduction in available proxy devices came after Google’s Threat Intelligence Group used legal action and intelligence sharing to target the company’s domain infrastructure, Google said in a blog post Wednesday. Google’s action, aided by Cloudflare, Lumen’s Black Lotus Labs and Spur, impaired some of IPIDEA’s proxy infrastructure, but not all of it. The coordinated strikes against malicious infrastructure underscore the back-and-forth struggle threat hunters confront wh", "topic": "ddos", "time": 1770295326}], "recent_topics": ["general", "breach", "vulnerability", "general", "apt", "phishing", "apt", "phishing", "phishing", "ransomware", "general", "general", "ransomware", "apt", "ddos"]}