{"posted_ids": {"ce4860e2639fb9f56b7a1dd3b6f51c22": 1769527449, "05dbe9f2e327b44defc3099c4c983550": 1769527456, "1fa259ac97cc913f4f9ed62994b42429": 1769527462, "48e2921adb71b0a7d109742b763b211e": 1769527506, "b1c3970fd42e4cfffecd7b05ecd6bab6": 1769538509, "719239e3221a3e76e5c2a617a261e1d0": 1769581594, "ec68d093efd8c27062e86b54e8b09fa6": 1769603588, "76143a69677c292de741fd188e68edfb": 1769613895, "67a5482aee878927e4f5a41c9cf4a953": 1769613897, "1ea89843d0f60649c8318b8bbedba619": 1769613903, "a399c38ee12638b53e6a967294698899": 1769624878, "9b5b343e667526a31963ee7ed03f89f1": 1769624880, "142a06ca71886dcdec8d4e664321591a": 1769624885, "598dddf8979263e19f2d2ab62b0729d8": 1769668618, "83a3d2eea907112506059e6a479c884c": 1769668620, "47049a7169772dd6a23256ccf18b9e70": 1769668625, "7cf0c429472b8d47cf2bb75256e0182e": 1769690289, "cdfb82517ad327c4ed338943e2a3c2ea": 1769690292, "cc7e68ec085e4fd9dafc1486f29adc64": 1769690295, "fd2d24ecbc14da1149cb2ee622f928ac": 1769690297, "047acea124a2a36615643fc16bd44a6c": 1769690301, "128e1916029ea42121f9de03067b30b2": 1769700508, "3a57914fc489383f10b1c7921acf11a7": 1769700508, "a8a7a761cd72e2732bd9e3c75c4a2acc": 1769711628, "e2f2f910ef5bf8f62421bfeb16de2098": 1769755080, "3e69853834072bcbf755d4506f2bcfcd": 1769755083, "a78c12c954e3e223daa82034bd99a976": 1769776601, "ca5efb011ebb45ce9ed9d5aad30ea99a": 1769776605, "a47478f30bce5b93eca78360855f1a33": 1769786795, "96f240655017bfaff61df3141882d54d": 1769786798, "5344c754a040d1dc426908ac1a410d71": 1769797893}, "recent_titles": ["Джейлбрейк ИИ поэзией: как обойти защиту чат-ботов стихами | Блог Касперского", "Что такое «проблема 2038» и как устранить ее в организации", "[Перевод] EDRStartupHinder: Блокировщик EDR процессов", "Как работают алгоритмы защиты от DDoS-атак", "«Антивирус мёртв. Да здравствует антивирус!»", "GreatEasyCert или как реализовать контейнер ключа по ГОСТу", "Киберпреступные форумы: их экономика, инфраструктура и эволюция защиты", "From Triage to Threat Hunts: How AI Accelerates SecOps", "Ransomware Attacks are on the Rise", "Critical vm2 Node.js Flaw Allows Sandbox Escape and Arbitrary Code Execution", "Watering Hole Attacks Push ScanBox Keylogger", "Happy 16th Birthday, KrebsOnSecurity.com!", "Fake Moltbot AI Coding Assistant on VS Code Marketplace Drops Malware", "Who Benefited from the Aisuru and Kimwolf Botnets?", "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms", "Kimwolf Botnet Lurking in Corporate, Govt. Networks", "Cybercriminals Are Selling Access to Chinese Surveillance Cameras", "Survey of 100+ Energy Systems Reveals Critical OT Cybersecurity Gaps", "3 Decisions CISOs Need to Make to Prevent Downtime Risk in 2026", "Patch Tuesday, January 2026 Edition", "SolarWinds Fixes Four Critical Web Help Desk Flaws With Unauthenticated RCE and Auth Bypass", "ThreatsDay Bulletin: New RCEs, Darknet Busts, Kernel Bugs & 25+ More Stories", "The Kimwolf Botnet is Stalking Your Local Network", "Google Patches Chrome’s Fifth Zero-Day of the Year", "Credential stuffing: What it is and how to protect yourself", "ESET Research: Sandworm behind cyberattack on Poland’s power grid in late 2025", "Four arrested in crackdown on Discord-based SWATting and doxing", "AIs are Getting Better at Finding and Exploiting Internet Vulnerabilities", "If you don’t control your keys, you don’t control your data", "Operation Winter SHIELD: FBI Issues Call to Arms for Organizations to Improve Cybersecurity", "In Other News: Paid for Being Jailed, Google’s $68M Settlement, CISA Chief’s ChatGPT Leak"], "recent_posts": [{"title": "Google Patches Chrome’s Fifth Zero-Day of the Year", "text": "An insufficient validation input flaw, one of 11 patched in an update this week, could allow for arbitrary code execution and is under active attack. ", "time": 1769711628}, {"title": "Credential stuffing: What it is and how to protect yourself", "text": "Reusing passwords may feel like a harmless shortcut – until a single breach opens the door to multiple accounts ", "time": 1769755080}, {"title": "ESET Research: Sandworm behind cyberattack on Poland’s power grid in late 2025", "text": "The attack involved data-wiping malware that ESET researchers have now analyzed and named DynoWiper ", "time": 1769755083}, {"title": "Four arrested in crackdown on Discord-based SWATting and doxing", "text": "How badly do you want to win an online argument? I certainly hope it's not enough to put the life of the other person at risk. Police in Hungary and Romania have arrested four young men suspected of making hoax bomb threats and terrorising internet users through SWATting and doxing attacks. Read more in my article on the Hot for Security blog. ", "time": 1769776601}, {"title": "AIs are Getting Better at Finding and Exploiting Internet Vulnerabilities", "text": "Really interesting blog post from Anthropic: In a recent evaluation of AI models’ cyber capabilities, current Claude models can now succeed at multistage attacks on networks with dozens of hosts using only standard, open-source tools, instead of the custom tools needed by previous generations. This illustrates how barriers to the use of AI in relatively autonomous cyber workflows are rapidly coming down, and highlights the importance of security fundamentals like promptly patching known vulnerabilities. […] A notable development during the testing of Claude Sonnet 4.5 is that the model can now succeed on a minority of the networks without the custom cyber toolkit needed by previous generations. In particular, Sonnet 4.5 can now exfiltrate all of the (simulated) personal information in a high-fidelity simulation of the Equifax data breach—­one of the costliest cyber attacks in history—­using only a Bash shell on a widely-available Kali Linux host (standard, open-source tools for penetra", "time": 1769776605}, {"title": "If you don’t control your keys, you don’t control your data", "text": "The Microsoft-BitLocker episode highlights a larger design problem: when providers retain recovery keys, encryption becomes conditional. The post If you don’t control your keys, you don’t control your data appeared first on CyberScoop . A recent Forbes investigation revealed that Microsoft has allegedly been handing over Bitlocker encryption recovery keys to law enforcement when served with warrants. Microsoft says it receives about 20 such requests annually. Taken narrowly, this may appear to be a routine case of lawful compliance. On closer inspection, it raises a consequential question about how modern digital systems are designed and who ultimately controls the data they hold. The essence of the debate centers on data sovereignty, or whether individuals and organizations truly control their own data, or whether that control can be involuntarily transferred because of architectural choices made by technology providers. BitLocker itself is strong encryption. Federal investigators hav", "topic": "apt", "time": 1769786795}, {"title": "Operation Winter SHIELD: FBI Issues Call to Arms for Organizations to Improve Cybersecurity", "text": "The FBI outlines ten actions which organizations can take to defend networks against cybercriminal and nation-state threats ", "topic": "apt", "time": 1769786798}, {"title": "In Other News: Paid for Being Jailed, Google’s $68M Settlement, CISA Chief’s ChatGPT Leak", "text": "Other noteworthy stories that might have slipped under the radar: Apple updates platform security guide, LastPass detects new phishing wave, CISA withdraws from RSA Conference. The post In Other News: Paid for Being Jailed, Google’s $68M Settlement, CISA Chief’s ChatGPT Leak appeared first on SecurityWeek . ", "topic": "phishing", "time": 1769797893}], "recent_topics": ["apt", "apt", "phishing"]}