{"posted_ids": {"ce4860e2639fb9f56b7a1dd3b6f51c22": 1769527449, "05dbe9f2e327b44defc3099c4c983550": 1769527456, "1fa259ac97cc913f4f9ed62994b42429": 1769527462, "48e2921adb71b0a7d109742b763b211e": 1769527506, "b1c3970fd42e4cfffecd7b05ecd6bab6": 1769538509, "719239e3221a3e76e5c2a617a261e1d0": 1769581594, "ec68d093efd8c27062e86b54e8b09fa6": 1769603588, "76143a69677c292de741fd188e68edfb": 1769613895, "67a5482aee878927e4f5a41c9cf4a953": 1769613897, "1ea89843d0f60649c8318b8bbedba619": 1769613903, "a399c38ee12638b53e6a967294698899": 1769624878, "9b5b343e667526a31963ee7ed03f89f1": 1769624880, "142a06ca71886dcdec8d4e664321591a": 1769624885, "598dddf8979263e19f2d2ab62b0729d8": 1769668618, "83a3d2eea907112506059e6a479c884c": 1769668620, "47049a7169772dd6a23256ccf18b9e70": 1769668625, "7cf0c429472b8d47cf2bb75256e0182e": 1769690289, "cdfb82517ad327c4ed338943e2a3c2ea": 1769690292, "cc7e68ec085e4fd9dafc1486f29adc64": 1769690295, "fd2d24ecbc14da1149cb2ee622f928ac": 1769690297, "047acea124a2a36615643fc16bd44a6c": 1769690301, "128e1916029ea42121f9de03067b30b2": 1769700508, "3a57914fc489383f10b1c7921acf11a7": 1769700508, "a8a7a761cd72e2732bd9e3c75c4a2acc": 1769711628, "e2f2f910ef5bf8f62421bfeb16de2098": 1769755080, "3e69853834072bcbf755d4506f2bcfcd": 1769755083, "a78c12c954e3e223daa82034bd99a976": 1769776601, "ca5efb011ebb45ce9ed9d5aad30ea99a": 1769776605, "a47478f30bce5b93eca78360855f1a33": 1769786795, "96f240655017bfaff61df3141882d54d": 1769786798, "5344c754a040d1dc426908ac1a410d71": 1769797893, "bd2c6f7814ae9945809f492e65b3451a": 1769840953, "67a8944a115c0d10f4548552f26db30c": 1769840956, "d54683fb31f21455aa9f98f4b6abbbf0": 1769840960, "44956c1d55aedbdc79e99f93c141e04b": 1769862619, "4e5aafbbe722acf270bcad99c4529914": 1769862623, "09af623b3a6c7cf5b83aae1b420adf42": 1769872534, "97d198348592881398caec164087bd55": 1769872536, "1ecd28fec324c67a453ab6c50c1e0e0f": 1769872539, "9796ef12ac8049681fc26a979af0820c": 1769872543, "2362d7e10808bbfa568f02ff596837ad": 1769883705, "c152667af665bc84f8972627b05d9278": 1769883706, "f1e26154f3b61efd4a4f1701e0199256": 1769928013, "cde6d7960874cc94d7a6ea6397e60154": 1769928017, "ac930f4c74bb9b93fce6b882525c5c21": 1769949096, "7233f8ca020b5b10e654b217b8fe8de1": 1769959045, "7eb3653c61d1b90503c3d0186b2d71b8": 1769959046, "bbb83ad0dd8b0ef6e5dcd8a442b13a9b": 1769970247, "6b49ed4eb774eae5dbad05546e62552a": 1769970247, "f30f2fb9e0fcb57533ce9ac97f535e1f": 1769970248, "167646e7c8eb392d72c703eeed7ec9ca": 1770015260, "abfbf50d6139f91d5107fb23a809af13": 1770035964, "559283a743596c82cea1e1631f5eec0e": 1770046339, "5fd6abc622fb6bd04a19d272572139fe": 1770046343, "bbe66efb3e506a21119d72ee7802192f": 1770057197, "e51a60d75077866cb93d6ff5a8c4a509": 1770057199, "add905ee84c780931a0d364ed4f352e4": 1770100824, "d3572663efdcd5c9fc62380fd904b1e6": 1770122418, "3970df41d90910e8b56794d2942fc6f5": 1770122418, "a1eab9f1be7120be6e69197bf69bf42f": 1770122420, "0ec1d878d214bde65df5afc3648ddcb5": 1770133308, "445f200c30576d590d846da626a6c013": 1770144286, "5b1246e671a4822f8264b44c26c3bbbf": 1770144289}, "recent_titles": ["Who Benefited from the Aisuru and Kimwolf Botnets?", "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms", "Kimwolf Botnet Lurking in Corporate, Govt. Networks", "Cybercriminals Are Selling Access to Chinese Surveillance Cameras", "Survey of 100+ Energy Systems Reveals Critical OT Cybersecurity Gaps", "3 Decisions CISOs Need to Make to Prevent Downtime Risk in 2026", "Patch Tuesday, January 2026 Edition", "SolarWinds Fixes Four Critical Web Help Desk Flaws With Unauthenticated RCE and Auth Bypass", "ThreatsDay Bulletin: New RCEs, Darknet Busts, Kernel Bugs & 25+ More Stories", "The Kimwolf Botnet is Stalking Your Local Network", "Google Patches Chrome’s Fifth Zero-Day of the Year", "Credential stuffing: What it is and how to protect yourself", "ESET Research: Sandworm behind cyberattack on Poland’s power grid in late 2025", "Four arrested in crackdown on Discord-based SWATting and doxing", "AIs are Getting Better at Finding and Exploiting Internet Vulnerabilities", "If you don’t control your keys, you don’t control your data", "Operation Winter SHIELD: FBI Issues Call to Arms for Organizations to Improve Cybersecurity", "In Other News: Paid for Being Jailed, Google’s $68M Settlement, CISA Chief’s ChatGPT Leak", "WhatsApp rolls out new protections against advanced exploits and spyware", "This startup aims to solve crypto’s broken key management problem", "The AI Fix #85: ChatGPT gets ads, pets get AI therapists, and everyone’s wrong about LLMs", "Meta confirms it’s working on premium subscription for its apps", "Second Round of Critical RCE Bugs in n8n Spikes Corporate Risk", "Mandiant details how ShinyHunters abuse SSO to steal cloud data", "Researcher reveals evidence of private Instagram profiles leaking photos", "Microsoft links Windows 11 boot failures to failed December 2025 update", "Hugging Face abused to spread thousands of Android malware variants", "Microsoft to disable NTLM by default in future Windows releases", "Iran-Linked RedKitten Cyber Campaign Targets Human Rights NGOs and Activists", "Malicious Chrome extensions can spy on your ChatGPT chats", "Ransomware Victim Numbers Rise, Despite Drop in Active Extortion Groups", "Lawmakers wonder when Trump administration will weigh on soon-expired surveillance powers", "Mandiant Finds ShinyHunters-Style Vishing Attacks Stealing MFA to Breach SaaS Platforms", "SmarterMail Fixes Critical Unauthenticated RCE Flaw with CVSS 9.3 Score", "White House Scraps ‘Burdensome’ Software Security Rules", "AI jailbreaking via poetry: bypassing chatbot defenses with rhyme | Kaspersky official blog", "From Quantum to AI Risks: Preparing for Cybersecurity's Future", "Privileged File System Vulnerability Present in a SCADA System", "Securing Vibe Coding Tools: Scaling Productivity Without Scaling Risk", "The $0 Transaction That Signaled a Nation-State Cyberattack", "3 security gadgets I never leave home without (and they're more affordable than you'd think)", "Аgentic AI security measures based on the OWASP ASI Top 10", "Notepad++ Update Hijacking Linked to Hosting Provider Compromise", "Most Parked Domains Now Serving Malicious Content", "This month in security with Tony Anscombe – January 2026 edition", "Threat and Vulnerability Management in 2026", "Hacking attack leaves Russian car owners locked out of their vehicles", "Malicious MoltBot skills used to push password-stealing malware", "Iron Mountain: Data breach mostly limited to marketing materials", "Hackers exploit critical React Native Metro bug to breach dev systems"], "recent_posts": [{"title": "The AI Fix #85: ChatGPT gets ads, pets get AI therapists, and everyone’s wrong about LLMs", "text": "In episode 85 of The AI Fix, Graham discovers that Silicon Valley has the solution to your pet's mental health crisis, and Mark explains why AI godfather Yann LeCun thinks the entire AI industry is wrong about LLMs. Also in this episode, OpenAI decides to ruin ChatGPT with ads; Sam Altman and Elon Musk and have a public spat over whose AI is more murderous; humanoid robots turn up at CES 2026 and answer of whether robots can fight—with a resounding \"no\"; and AI slop forces the beloved cURL project to shut down its bug bounty program. All this and much more is discussed in the latest edition of \"The AI Fix\" podcast by Graham Cluley and Mark Stockley. ", "topic": "general", "time": 1769840960}, {"title": "Meta confirms it’s working on premium subscription for its apps", "text": "Details are currently thin, but one thing is clear: paying more is unlikely to buy users meaningful privacy or less tracking. Meta plans to test exclusive features that will be incorporated in paid versions of Facebook, Instagram, and WhatsApp. It confirmed these plans to TechCrunch . But these plans are not to be confused with the ad-free subscription options that Meta introduced for Facebook and Instagram in the EU, the European Economic Area, and Switzerland in late 2023 and framed as a way to comply with General Data Protection Regulation (GDPR) and Digital Markets Act requirements. From November 2023, users in those regions could either keep using the services for free with personalized ads or pay a monthly fee for an ad‑free experience. European rules require Meta to get users’ consent in order to show them targeted ads, so this was an obvious attempt to recoup advertising revenue when users declined to give that consent. This year, users in the UK were given the same choice: use", "topic": "general", "time": 1769862619}, {"title": "Second Round of Critical RCE Bugs in n8n Spikes Corporate Risk", "text": "A new around of vulnerabilities in the popular AI automation platform could let attackers hijack servers and steal credentials, allowing full takeover. ", "topic": "phishing", "time": 1769862623}, {"title": "Mandiant details how ShinyHunters abuse SSO to steal cloud data", "text": "Mandiant says a wave of recent ShinyHunters SaaS data-theft attacks is being fueled by targeted voice phishing (vishing) attacks and company-branded phishing sites that steal single sign-on (SSO) credentials and multi-factor authentication (MFA) codes. [...] ", "topic": "phishing", "time": 1769872534}, {"title": "Researcher reveals evidence of private Instagram profiles leaking photos", "text": "A researcher has released detailed evidence showing some Instagram private accounts exposed photo links to unauthenticated visitors. The issue was later fixed, but Meta closed the report as not applicable and did not respond to multiple requests for comment. [...] ", "topic": "breach", "time": 1769872536}, {"title": "Microsoft links Windows 11 boot failures to failed December 2025 update", "text": "Microsoft has linked recent reports of Windows 11 boot failures after installing the January 2026 updates to previously failed attempts to install the December 2025 security update, which left systems in an \"improper state.\" [...] ", "topic": "patch", "time": 1769872539}, {"title": "Hugging Face abused to spread thousands of Android malware variants", "text": "A new Android malware campaign is using the Hugging Face platform as a repository for thousands of variations of an APK payload that collects credentials for popular financial and payment services. [...] ", "topic": "phishing", "time": 1769872543}, {"title": "Microsoft to disable NTLM by default in future Windows releases", "text": "Microsoft announced that it will disable the 30-year-old NTLM authentication protocol by default in upcoming Windows releases due to security vulnerabilities that expose organizations to cyberattacks. [...] ", "topic": "general", "time": 1769883705}, {"title": "Iran-Linked RedKitten Cyber Campaign Targets Human Rights NGOs and Activists", "text": "A Farsi-speaking threat actor aligned with Iranian state interests is suspected to be behind a new campaign targeting non-governmental organizations and individuals involved in documenting recent human rights abuses. The activity, observed by HarfangLab in January 2026, has been codenamed RedKitten. It's said to coincide with the nationwide unrest in Iran that began towards the end of 2025, ", "topic": "general", "time": 1769883706}, {"title": "Malicious Chrome extensions can spy on your ChatGPT chats", "text": "Researchers found 16 malicious browser extensions that can quietly hijack active ChatGPT sessions and siphon user data. Researchers discovered 16 malicious browser extensions for Google Chrome and Microsoft Edge that steal ChatGPT session tokens, giving attackers access to accounts, including conversation history and metadata. The 16 malicious extensions (15 for Chrome and 1 for Edge) claim to improve and optimize ChatGPT, but instead siphon users’ session tokens to attackers. Together, they have been downloaded around 900 times, a relatively small number compared to other malicious extensions . Despite benign descriptions and, in some cases, a “featured” badge, the real goal of these extensions is to hijack ChatGPT identities by stealing session authentication tokens and sending them to attacker-controlled backends. Possession of these tokens gives attackers the same level of access as the user, including conversation history and metadata. In addition to your ChatGPT session token, th", "topic": "phishing", "time": 1769928013}, {"title": "Ransomware Victim Numbers Rise, Despite Drop in Active Extortion Groups", "text": "Ransomware victims surged in Q4 2025 despite fewer active extortion groups, with data leaks rising 50%, ReliaQuest researchers report ", "topic": "ransomware", "time": 1769928017}, {"title": "Lawmakers wonder when Trump administration will weigh on soon-expired surveillance powers", "text": "The Senate Judiciary Committee held a hearing on Section 702, set to sunset at the end of April, but with no Trump administration witnesses present. The post Lawmakers wonder when Trump administration will weigh on soon-expired surveillance powers appeared first on CyberScoop . There’s a growing question on Capitol Hill as the expiration of sweeping U.S. government surveillance powers looms: Where is the Trump administration? The Senate Judiciary Committee held a hearing Wednesday on the 2024 law that revised the surveillance authorities known as Section 702, a part of the Foreign Intelligence Surveillance Act. Advocates have said that information collected under Section 702 — under which national security officials controversially can use U.S. citizens’ personal information to query a database for collection of their electronic communications with foreign targets without a warrant — accounts for 60% of the intelligence included in the President’s Daily Briefing. But no Trump administr", "topic": "general", "time": 1769949096}, {"title": "Mandiant Finds ShinyHunters-Style Vishing Attacks Stealing MFA to Breach SaaS Platforms", "text": "Google-owned Mandiant on Friday said it identified an \"expansion in threat activity\" that uses tradecraft consistent with extortion-themed attacks orchestrated by a financially motivated hacking group known as ShinyHunters. The attacks leverage advanced voice phishing (aka vishing) and bogus credential harvesting sites mimicking targeted companies to gain unauthorized access to victim ", "topic": "phishing", "time": 1769959045}, {"title": "SmarterMail Fixes Critical Unauthenticated RCE Flaw with CVSS 9.3 Score", "text": "SmarterTools has addressed two more security flaws in SmarterMail email software, including one critical security flaw that could result in arbitrary code execution. The vulnerability, tracked as CVE-2026-24423, carries a CVSS score of 9.3 out of 10.0. \"SmarterTools SmarterMail versions prior to build 9511 contain an unauthenticated remote code execution vulnerability in the ConnectToHub API ", "topic": "vulnerability", "time": 1769959046}, {"title": "White House Scraps ‘Burdensome’ Software Security Rules", "text": "Two Biden-era memorandums have been revoked, but some of the resources they provide can still be used by government organizations. The post White House Scraps ‘Burdensome’ Software Security Rules appeared first on SecurityWeek . ", "topic": "general", "time": 1769970247}, {"title": "AI jailbreaking via poetry: bypassing chatbot defenses with rhyme | Kaspersky official blog", "text": "A new study shows that verse-based prompts can slash the effectiveness of AI safety constraints. We’re breaking down an experiment involving 25 language models and its key takeaways. Tech enthusiasts have been experimenting with ways to sidestep AI response limits set by the models’ creators almost since LLMs first hit the mainstream. Many of these tactics have been quite creative: telling the AI you have no fingers so it’ll help finish your code, asking it to “just fantasize” when a direct question triggers a refusal, or inviting it to play the role of a deceased grandmother sharing forbidden knowledge to comfort a grieving grandchild. Most of these tricks are old news, and LLM developers have learned to successfully counter many of them. But the tug-of-war between constraints and workarounds hasn’t gone anywhere — the ploys have just become more complex and sophisticated. Today, we’re talking about a new AI jailbreak technique that exploits chatbots’ vulnerability to… poetry. Yes, yo", "topic": "phishing", "time": 1769970247}, {"title": "From Quantum to AI Risks: Preparing for Cybersecurity's Future", "text": "In the latest edition of \"Reporters' Notebook,\" a trio of journalists urge the cybersecurity industry to prioritize patching vulnerabilities, preparing for quantum threats, and refining AI applications, ", "topic": "patch", "time": 1769970248}, {"title": "Privileged File System Vulnerability Present in a SCADA System", "text": "We detail our discovery of CVE-2025-0921. This privileged file system flaw in SCADA system Iconics Suite could lead to a denial-of-service (DoS) attack. The post Privileged File System Vulnerability Present in a SCADA System appeared first on Unit 42 . ", "topic": "vulnerability", "time": 1770015260}, {"title": "Securing Vibe Coding Tools: Scaling Productivity Without Scaling Risk", "text": "AI-generated code looks flawless until it isn't. Unit 42 breaks down how to expose these invisible flaws before they turn into your next breach. The post Securing Vibe Coding Tools: Scaling Productivity Without Scaling Risk appeared first on Unit 42 . ", "topic": "general", "time": 1770035964}, {"title": "The $0 Transaction That Signaled a Nation-State Cyberattack", "text": "A $0 card test signaled a Chinese state-linked cyberattack on Anthropic’s AI platform. Learn how card-testing fraud intelligence spots nation-state ops early. Key Points: Fraud enables cyber operations: Threat actors used compromised payment cards validated through Chinese-operated card-testing services to attempt unauthorized access to Anthropic's AI platform during a reported state-sponsored espionage campaign. Card testing signals downstream attacks: The observed fraud followed a predictable kill chain—compromise, validation, resale, and attempted cashout—providing early warning indicators that preceded the final malicious transaction. Recorded Future’s take: Proactive fraud intelligence prevents broader threats. Tester merchant intelligence can identify compromised cards before they're used for high-value fraud or to support advanced threat actor operations.", "topic": "apt", "time": 1770046339}, {"title": "3 security gadgets I never leave home without (and they're more affordable than you'd think)", "text": "These must-have tools help protect against hacking and data loss, without costing an arm and a leg. ", "topic": "general", "time": 1770046343}, {"title": "Аgentic AI security measures based on the OWASP ASI Top 10", "text": "Key security controls to implement in your organization to protect against malicious AI agent behavior. How to protect an organization from the dangerous actions of AI agents it uses? This isn’t just a theoretical what-if anymore — considering the actual damage autonomous AI can do ranges from providing poor customer service to destroying corporate primary databases . It’s a question business leaders are currently hammering away at, and government agencies and security experts are racing to provide answers to. For CIOs and CISOs, AI agents create a massive governance headache. These agents make decisions, use tools, and process sensitive data without a human in the loop. Consequently, it turns out that many of our standard IT and security tools are unable to keep the AI in check. The non-profit OWASP Foundation has released a handy playbook on this very topic. Their comprehensive Top 10 risk list for agentic AI applications covers everything from old-school security threats like privil", "topic": "phishing", "time": 1770057197}, {"title": "Notepad++ Update Hijacking Linked to Hosting Provider Compromise", "text": "A supply chain attack on Notepad++ update process was linked to compromised hosting infrastructure ", "topic": "patch", "time": 1770057199}, {"title": "Most Parked Domains Now Serving Malicious Content", "text": "Direct navigation -- the act of visiting a website by manually typing a domain name in a web browser -- has never been riskier: A new study finds the vast majority of \"parked\" domains -- mostly expired or dormant domain names, or common misspellings of popular websites -- are now configured to redirect visitors to sites that foist scams and malware. Direct navigation — the act of visiting a website by manually typing a domain name in a web browser — has never been riskier: A new study finds the vast majority of “parked” domains — mostly expired or dormant domain names, or common misspellings of popular websites — are now configured to redirect visitors to sites that foist scams and malware. A lookalike domain to the FBI Internet Crime Complaint Center website, returned a non-threatening parking page (left) whereas a mobile user was instantly directed to deceptive content in October 2025 (right). Image: Infoblox. When Internet users try to visit expired domain names or accidentally navi", "topic": "phishing", "time": 1770100824}, {"title": "This month in security with Tony Anscombe – January 2026 edition", "text": "The trends from January offer useful clues about the risks and priorities that security teams are likely to contend with throughout the year ", "topic": "general", "time": 1770122418}, {"title": "Threat and Vulnerability Management in 2026", "text": "Understand the future of threat and vulnerability management (TVM). Learn what TVM is, why traditional tools fail, and how intelligence is essential in today’s landscape. Key Takeaways: Traditional vulnerability management tools can no longer keep up with the speed of modern exploitation—threat context is now mandatory. Threat and Vulnerability Management (TVM) systems unify asset discovery, vulnerability data, and real-time external threat intelligence to prioritize real risk. Static CVSS scores fail to reflect exploitation likelihood ; intelligence-driven, dynamic risk scoring is essential in 2026. Organizations that integrate vulnerability intelligence and attack surface intelligence reduce remediation time and security waste , enhancing detection and remediation while reducing alert fatigue. Why Threat and Vulnerability Management Must Evolve in 2026 Security teams currently find themselves at a crossroads. Year over year, CVE volumes continue to surge higher and higher. Exploitati", "topic": "ransomware", "time": 1770122418}, {"title": "Hacking attack leaves Russian car owners locked out of their vehicles", "text": "Imagine the scene. It's a cold Monday morning in Moscow. You walk out to your car, coffee in hand, ready to face the day. You press the button to unlock your car, and ... nothing happens. You try again. Still nothing. The alarm starts blaring. You can't turn it off. Read more in my article on the Fortra blog. ", "topic": "general", "time": 1770122420}, {"title": "Malicious MoltBot skills used to push password-stealing malware", "text": "More than 230 malicious packages for the personal AI assistant OpenClaw (formerly known as Moltbot and ClawdBot) have been published in less than a week on the tool's official registry and on GitHub. [...] ", "topic": "general", "time": 1770133308}, {"title": "Iron Mountain: Data breach mostly limited to marketing materials", "text": "Iron Mountain, a leading data storage and recovery services company, says that a recent breach claimed by the Everest extortion gang is limited to mostly marketing materials. [...] ", "topic": "breach", "time": 1770144286}, {"title": "Hackers exploit critical React Native Metro bug to breach dev systems", "text": "Hackers are targeting developers by exploiting the critical vulnerability CVE-2025-11953 in the Metro server for React Native to deliver malicious payloads for Windows and Linux. [...] ", "topic": "vulnerability", "time": 1770144289}], "recent_topics": ["phishing", "patch", "vulnerability", "general", "apt", "general", "phishing", "patch", "phishing", "general", "ransomware", "general", "general", "breach", "vulnerability"]}