{"posted_ids": {"ce4860e2639fb9f56b7a1dd3b6f51c22": 1769527449, "05dbe9f2e327b44defc3099c4c983550": 1769527456, "1fa259ac97cc913f4f9ed62994b42429": 1769527462, "48e2921adb71b0a7d109742b763b211e": 1769527506, "b1c3970fd42e4cfffecd7b05ecd6bab6": 1769538509, "719239e3221a3e76e5c2a617a261e1d0": 1769581594, "ec68d093efd8c27062e86b54e8b09fa6": 1769603588, "76143a69677c292de741fd188e68edfb": 1769613895, "67a5482aee878927e4f5a41c9cf4a953": 1769613897, "1ea89843d0f60649c8318b8bbedba619": 1769613903, "a399c38ee12638b53e6a967294698899": 1769624878, "9b5b343e667526a31963ee7ed03f89f1": 1769624880, "142a06ca71886dcdec8d4e664321591a": 1769624885, "598dddf8979263e19f2d2ab62b0729d8": 1769668618, "83a3d2eea907112506059e6a479c884c": 1769668620, "47049a7169772dd6a23256ccf18b9e70": 1769668625, "7cf0c429472b8d47cf2bb75256e0182e": 1769690289, "cdfb82517ad327c4ed338943e2a3c2ea": 1769690292, "cc7e68ec085e4fd9dafc1486f29adc64": 1769690295, "fd2d24ecbc14da1149cb2ee622f928ac": 1769690297, "047acea124a2a36615643fc16bd44a6c": 1769690301, "128e1916029ea42121f9de03067b30b2": 1769700508, "3a57914fc489383f10b1c7921acf11a7": 1769700508, "a8a7a761cd72e2732bd9e3c75c4a2acc": 1769711628, "e2f2f910ef5bf8f62421bfeb16de2098": 1769755080, "3e69853834072bcbf755d4506f2bcfcd": 1769755083, "a78c12c954e3e223daa82034bd99a976": 1769776601, "ca5efb011ebb45ce9ed9d5aad30ea99a": 1769776605, "a47478f30bce5b93eca78360855f1a33": 1769786795, "96f240655017bfaff61df3141882d54d": 1769786798, "5344c754a040d1dc426908ac1a410d71": 1769797893, "bd2c6f7814ae9945809f492e65b3451a": 1769840953, "67a8944a115c0d10f4548552f26db30c": 1769840956, "d54683fb31f21455aa9f98f4b6abbbf0": 1769840960, "44956c1d55aedbdc79e99f93c141e04b": 1769862619, "4e5aafbbe722acf270bcad99c4529914": 1769862623, "09af623b3a6c7cf5b83aae1b420adf42": 1769872534, "97d198348592881398caec164087bd55": 1769872536, "1ecd28fec324c67a453ab6c50c1e0e0f": 1769872539, "9796ef12ac8049681fc26a979af0820c": 1769872543, "2362d7e10808bbfa568f02ff596837ad": 1769883705, "c152667af665bc84f8972627b05d9278": 1769883706, "f1e26154f3b61efd4a4f1701e0199256": 1769928013, "cde6d7960874cc94d7a6ea6397e60154": 1769928017, "ac930f4c74bb9b93fce6b882525c5c21": 1769949096, "7233f8ca020b5b10e654b217b8fe8de1": 1769959045, "7eb3653c61d1b90503c3d0186b2d71b8": 1769959046, "bbb83ad0dd8b0ef6e5dcd8a442b13a9b": 1769970247, "6b49ed4eb774eae5dbad05546e62552a": 1769970247, "f30f2fb9e0fcb57533ce9ac97f535e1f": 1769970248, "167646e7c8eb392d72c703eeed7ec9ca": 1770015260, "abfbf50d6139f91d5107fb23a809af13": 1770035964, "559283a743596c82cea1e1631f5eec0e": 1770046339, "5fd6abc622fb6bd04a19d272572139fe": 1770046343, "bbe66efb3e506a21119d72ee7802192f": 1770057197, "e51a60d75077866cb93d6ff5a8c4a509": 1770057199, "add905ee84c780931a0d364ed4f352e4": 1770100824, "d3572663efdcd5c9fc62380fd904b1e6": 1770122418, "3970df41d90910e8b56794d2942fc6f5": 1770122418, "a1eab9f1be7120be6e69197bf69bf42f": 1770122420, "0ec1d878d214bde65df5afc3648ddcb5": 1770133308, "445f200c30576d590d846da626a6c013": 1770144286, "5b1246e671a4822f8264b44c26c3bbbf": 1770144289, "951d3d1ffb2192a51c672f4bbb5c9eb0": 1770187240, "885e2ce20812b8538f9d8885d6e6536e": 1770187242, "65ecc9221af521d544aa3749af461921": 1770208821, "60a2ba6b213146a8148183770646d83f": 1770219342, "d244595fb8a7945c65ba540544a1d549": 1770219345, "037f4cf279055f454ecea7c2328085f4": 1770230304, "da44eae3318d04a81847b750abedc0f5": 1770230306, "03b82920a9103017699f4f27b4578d12": 1770274076, "b6bfcc5bf6137e334a4ef4f8904283f7": 1770274076, "ea4ae26181435f0810fdc658b1067b76": 1770274080, "7adde96a4f4cd311bb518bbe0edb25cc": 1770295324, "445b456cf9e297631d49dac1ea54d869": 1770295326, "cbe621e9c5ed6865e0f7d50bb2db2bd8": 1770305680, "6118bd10b029262fb22434c81ceb2f9b": 1770305682, "af72cf73ea87edf9e001e3f6d6c61d99": 1770316735, "d0268c4cca7ed6eddd3e824abbbafeb9": 1770360195, "e99467ff0ff510ff2b67bc5ec56f6bdd": 1770360197, "450b8cd2076c7aa6f841d3d8e5f7027f": 1770381647, "aeec318283b313ed4b370b6de7a7561d": 1770381651, "e3a53a463250dd10e4060ff60bef13b7": 1770381655, "518a55bb008bb9d76290f6d774d21f7b": 1770391982, "d66fc8aef7e33cded4e01cfc4814a92f": 1770391986, "4f3d9cbf76f8ebb4abc922603e1c7a78": 1770403072, "3e762b4b51cd337599e0d10b39d50c8b": 1770445972}, "recent_titles": ["Researcher reveals evidence of private Instagram profiles leaking photos", "Microsoft links Windows 11 boot failures to failed December 2025 update", "Hugging Face abused to spread thousands of Android malware variants", "Microsoft to disable NTLM by default in future Windows releases", "Iran-Linked RedKitten Cyber Campaign Targets Human Rights NGOs and Activists", "Malicious Chrome extensions can spy on your ChatGPT chats", "Ransomware Victim Numbers Rise, Despite Drop in Active Extortion Groups", "Lawmakers wonder when Trump administration will weigh on soon-expired surveillance powers", "Mandiant Finds ShinyHunters-Style Vishing Attacks Stealing MFA to Breach SaaS Platforms", "SmarterMail Fixes Critical Unauthenticated RCE Flaw with CVSS 9.3 Score", "White House Scraps ‘Burdensome’ Software Security Rules", "AI jailbreaking via poetry: bypassing chatbot defenses with rhyme | Kaspersky official blog", "From Quantum to AI Risks: Preparing for Cybersecurity's Future", "Privileged File System Vulnerability Present in a SCADA System", "Securing Vibe Coding Tools: Scaling Productivity Without Scaling Risk", "The $0 Transaction That Signaled a Nation-State Cyberattack", "3 security gadgets I never leave home without (and they're more affordable than you'd think)", "Аgentic AI security measures based on the OWASP ASI Top 10", "Notepad++ Update Hijacking Linked to Hosting Provider Compromise", "Most Parked Domains Now Serving Malicious Content", "This month in security with Tony Anscombe – January 2026 edition", "Threat and Vulnerability Management in 2026", "Hacking attack leaves Russian car owners locked out of their vehicles", "Malicious MoltBot skills used to push password-stealing malware", "Iron Mountain: Data breach mostly limited to marketing materials", "Hackers exploit critical React Native Metro bug to breach dev systems", "Critical React Native Vulnerability Exploited in the Wild", "How fake party invitations are being used to install remote access tools", "8-Minute Access: AI Accelerates Breach of AWS Environment", "Russian Hackers Weaponize Microsoft Office Bug in Just 3 Days", "Microsoft Warns Python Infostealers Target macOS via Fake Ads and Installers", "Fake apps, NFC skimming attacks, and other Android issues in 2026 | Kaspersky official blog", "Researchers Warn of New “Vect” RaaS Variant", "Hackers compromise NGINX servers to redirect user traffic", "Critical n8n flaws disclosed along with public exploits", "CISA: VMware ESXi flaw now exploited in ransomware attacks", "GRU-Linked BlueDelta Evolves Credential Harvesting", "Google’s disruption rips millions out of devices out of malicious network", "How Manifest v3 forced us to rethink Browser Guard, and why that’s a good thing", "How does cyberthreat attribution help in practice?", "Global SystemBC Botnet Found Active Across 10,000 Infected Systems", "[updated] A fake cloud storage alert that ends at Freecash", "Malicious Commands in GitHub Codespaces Enable RCE", "Flickr Security Incident Tied to Third-Party Email System", "Sanctioned Bulletproof Host Linked to Hijacking of Old Home Routers", "Ransomware Gang Goes Full 'Godfather' With Cartel", "Flickr discloses potential data breach exposing users' names, emails", "CISA orders federal agencies to replace end-of-life edge devices", "New Technical Markers Reveal Expanding ShadowSyndicate Cybercriminal Infrastructure", "Apple Pay phish uses fake support calls to steal payment details"], "recent_posts": [{"title": "This month in security with Tony Anscombe – January 2026 edition", "text": "The trends from January offer useful clues about the risks and priorities that security teams are likely to contend with throughout the year ", "topic": "general", "time": 1770122418}, {"title": "Threat and Vulnerability Management in 2026", "text": "Understand the future of threat and vulnerability management (TVM). Learn what TVM is, why traditional tools fail, and how intelligence is essential in today’s landscape. Key Takeaways: Traditional vulnerability management tools can no longer keep up with the speed of modern exploitation—threat context is now mandatory. Threat and Vulnerability Management (TVM) systems unify asset discovery, vulnerability data, and real-time external threat intelligence to prioritize real risk. Static CVSS scores fail to reflect exploitation likelihood ; intelligence-driven, dynamic risk scoring is essential in 2026. Organizations that integrate vulnerability intelligence and attack surface intelligence reduce remediation time and security waste , enhancing detection and remediation while reducing alert fatigue. Why Threat and Vulnerability Management Must Evolve in 2026 Security teams currently find themselves at a crossroads. Year over year, CVE volumes continue to surge higher and higher. Exploitati", "topic": "ransomware", "time": 1770122418}, {"title": "Hacking attack leaves Russian car owners locked out of their vehicles", "text": "Imagine the scene. It's a cold Monday morning in Moscow. You walk out to your car, coffee in hand, ready to face the day. You press the button to unlock your car, and ... nothing happens. You try again. Still nothing. The alarm starts blaring. You can't turn it off. Read more in my article on the Fortra blog. ", "topic": "general", "time": 1770122420}, {"title": "Malicious MoltBot skills used to push password-stealing malware", "text": "More than 230 malicious packages for the personal AI assistant OpenClaw (formerly known as Moltbot and ClawdBot) have been published in less than a week on the tool's official registry and on GitHub. [...] ", "topic": "general", "time": 1770133308}, {"title": "Iron Mountain: Data breach mostly limited to marketing materials", "text": "Iron Mountain, a leading data storage and recovery services company, says that a recent breach claimed by the Everest extortion gang is limited to mostly marketing materials. [...] ", "topic": "breach", "time": 1770144286}, {"title": "Hackers exploit critical React Native Metro bug to breach dev systems", "text": "Hackers are targeting developers by exploiting the critical vulnerability CVE-2025-11953 in the Metro server for React Native to deliver malicious payloads for Windows and Linux. [...] ", "topic": "vulnerability", "time": 1770144289}, {"title": "Critical React Native Vulnerability Exploited in the Wild", "text": "Albeit mainly considered a theoretical risk, the flaw has been exploited to disable protections and deliver malware. The post Critical React Native Vulnerability Exploited in the Wild appeared first on SecurityWeek . ", "topic": "general", "time": 1770187240}, {"title": "How fake party invitations are being used to install remote access tools", "text": "Fake party invitations are used to install remote access tools, so the criminals are the ones invited. “You’re invited!” It sounds friendly, familiar and quite harmless. But in a scam we recently spotted, that simple phrase is being used to trick victims into installing a full remote access tool on their Windows computers—giving attackers complete control of the system. What appears to be a casual party or event invitation leads to the silent installation of ScreenConnect , a legitimate remote support tool quietly installed in the background and abused by attackers. Here’s how the scam works, why it’s effective, and how to protect yourself. The email: A party invitation Victims receive an email framed as a personal invitation—often written to look like it came from a friend or acquaintance. The message is deliberately informal and social, lowering suspicion and encouraging quick action. In the screenshot below, the email arrived from a friend whose email account had been hacked, but it", "topic": "apt", "time": 1770187242}, {"title": "8-Minute Access: AI Accelerates Breach of AWS Environment", "text": "The AI-assisted attack, which started with exposed credentials from public S3 buckets, rapidly achieved administrative privilges. ", "topic": "phishing", "time": 1770208821}, {"title": "Russian Hackers Weaponize Microsoft Office Bug in Just 3 Days", "text": "APT28's attacks rely on specially crafted Microsoft Rich Text Format (RTF) documents to kick off a multistage infection chain to deliver malicious payloads. ", "topic": "apt", "time": 1770219342}, {"title": "Microsoft Warns Python Infostealers Target macOS via Fake Ads and Installers", "text": "Microsoft has warned that information-stealing attacks are \"rapidly expanding\" beyond Windows to target Apple macOS environments by leveraging cross-platform languages like Python and abusing trusted platforms for distribution at scale. The tech giant's Defender Security Research Team said it observed macOS-targeted infostealer campaigns using social engineering techniques such as ClickFix since ", "topic": "phishing", "time": 1770219345}, {"title": "Fake apps, NFC skimming attacks, and other Android issues in 2026 | Kaspersky official blog", "text": "How to safely use Android devices in the face of 2026’s new security threats The year 2025 saw a record-breaking number of attacks on Android devices. Scammers are currently riding a few major waves: the hype surrounding AI apps, the urge to bypass site blocks or age checks, the hunt for a bargain on a new smartphone, the ubiquity of mobile banking, and, of course, the popularity of NFC. Let’s break down the primary threats of 2025–2026, and figure out how to keep your Android device safe in this new landscape. Sideloading Malicious installation packages (APK files) have always been the Final Boss among Android threats, despite Google’s multi-year efforts to fortify the OS. By using sideloading — installing an app via an APK file instead of grabbing it from the official store — users can install pretty much anything, including straight-up malware. And neither the rollout of Google Play Protect, nor the various permission restrictions for shady apps have managed to put a dent in the sca", "topic": "phishing", "time": 1770230304}, {"title": "Researchers Warn of New “Vect” RaaS Variant", "text": "A new ransomware-as-a-service operation dubbed “Vect” features custom malware ", "topic": "ransomware", "time": 1770230306}, {"title": "Hackers compromise NGINX servers to redirect user traffic", "text": "A threat actor is compromising NGINX servers in a campaign that hijacks user traffic and reroutes it through the attacker's backend infrastructure. [...] ", "topic": "general", "time": 1770274076}, {"title": "Critical n8n flaws disclosed along with public exploits", "text": "Multiple critical vulnerabilities in the popular n8n open-source workflow automation platform allow escaping the confines of the environment and taking complete control of the host server. [...] ", "topic": "general", "time": 1770274076}, {"title": "CISA: VMware ESXi flaw now exploited in ransomware attacks", "text": "CISA confirmed on Wednesday that ransomware gangs have begun exploiting a high-severity VMware ESXi sandbox escape vulnerability that was previously used in zero-day attacks. [...] ", "topic": "ransomware", "time": 1770274080}, {"title": "GRU-Linked BlueDelta Evolves Credential Harvesting", "text": "Insikt Group reveals how GRU-linked BlueDelta evolved credential-harvesting campaigns targeting government, energy, and research organizations across Europe and Eurasia. The analysis cut-off date for this report was September 11, 2025 Executive Summary Between February and September 2025, Recorded Future’s Insikt Group identified multiple credential-harvesting campaigns conducted by BlueDelta, a Russian state-sponsored threat group associated with the Main Directorate of the General Staff of the Armed Forces of the Russian Federation (GRU). This activity represents an expansion of BlueDelta’s ongoing credential-theft operations previously detailed in Insikt Group’s December 2025 report . Insikt Group identified BlueDelta targeting a small but distinct set of victims during its 2025 credential-harvesting activity. Targets included individuals linked to a Turkish energy and nuclear research agency, as well as staff affiliated with a European think tank and organizations in North Macedoni", "topic": "apt", "time": 1770295324}, {"title": "Google’s disruption rips millions out of devices out of malicious network", "text": "The actions impaired some of IPIDEA’s proxy infrastructure, but not all of it. The effort underscores the back-and-forth struggle of taking out pieces of cybercriminals’ vast and growing infrastructure. The post Google’s disruption rips millions out of devices out of malicious network appeared first on CyberScoop . Millions of devices used as proxies by cybercriminals, espionage groups and data thieves have been removed from circulation following Google’s disruption of IPIDEA, a China-based residential proxy network. The reduction in available proxy devices came after Google’s Threat Intelligence Group used legal action and intelligence sharing to target the company’s domain infrastructure, Google said in a blog post Wednesday. Google’s action, aided by Cloudflare, Lumen’s Black Lotus Labs and Spur, impaired some of IPIDEA’s proxy infrastructure, but not all of it. The coordinated strikes against malicious infrastructure underscore the back-and-forth struggle threat hunters confront wh", "topic": "ddos", "time": 1770295326}, {"title": "How Manifest v3 forced us to rethink Browser Guard, and why that’s a good thing", "text": "Browser Guard still blocks scams and phishing like it always has. But we had to rebuild the way it does that from the ground up. As a Browser Guard user, you might not have noticed much difference lately. Browser Guard still blocks scams and phishing attempts just like always, and, in many cases, even better. But behind the scenes, almost everything changed. The rules that govern how browser extensions work went through a major overhaul, and we had to completely rebuild how Browser Guard protects you. First, what is Manifest v3 (and v2)? Browser extensions include a configuration file called a “manifest”. Think of it as an instruction manual that tells your browser what an extension can do and how it’s allowed to do it. Manifest v3 is the latest version of that system, and it’s now the only option allowed in major browsers like Chrome and Edge. In Manifest v2 , Browser Guard could use highly customized logic to analyze and block suspicious activity as it happened , protecting you as yo", "topic": "phishing", "time": 1770305680}, {"title": "How does cyberthreat attribution help in practice?", "text": "Why it would be useful to identify the specific hacking group behind a malware file found in your infrastructure. Not every cybersecurity practitioner thinks it’s worth the effort to figure out exactly who’s pulling the strings behind the malware hitting their company. The typical incident investigation algorithm goes something like this: analyst finds a suspicious file → if the antivirus didn’t catch it, puts it into a sandbox to test → confirms some malicious activity → adds the hash to the blocklist → goes for coffee break. These are the go-to steps for many cybersecurity professionals — especially when they’re swamped with alerts, or don’t quite have the forensic skills to unravel a complex attack thread by thread. However, when dealing with a targeted attack, this approach is a one-way ticket to disaster — and here’s why. If an attacker is playing for keeps, they rarely stick to a single attack vector. There’s a good chance the malicious file has already played its part in a multi", "topic": "vulnerability", "time": 1770305682}, {"title": "Global SystemBC Botnet Found Active Across 10,000 Infected Systems", "text": "SystemBC malware linked to 10,000 infected IPs, posing risks to sensitive government infrastructure ", "topic": "ddos", "time": 1770316735}, {"title": "[updated] A fake cloud storage alert that ends at Freecash", "text": "We followed a fake cloud storage payment alert through deceptive affiliate redirects, ending at a familiar destination: Freecash. Last week we talked about an app that promises users they can make money testing games , or even just by scrolling through TikTok. Imagine our surprise when we ended up on a site promoting that same Freecash app while investigating a “cloud storage” phish. We’ve all probably seen one of those. They’re common enough and according to recent investigation by BleepingComputer , there’s a “large-scale cloud storage subscription scam campaign targeting users worldwide with repeated emails falsely warning recipients that their photos, files, and accounts are about to be blocked or deleted due to an alleged payment failure.” Based on the description in that article, the email we found appears to be part of this campaign. The subject line of the email is: “{Recipient}. Your Cloud Account has been locked on Sat, 24 Jan 2026 09:57:55 -0500. Your photos and videos will ", "topic": "apt", "time": 1770360195}, {"title": "Malicious Commands in GitHub Codespaces Enable RCE", "text": "Flaws in GitHub Codespaces allow RCE via crafted repositories or pull requests ", "topic": "general", "time": 1770360197}, {"title": "Flickr Security Incident Tied to Third-Party Email System", "text": "Potential breach at Flickr exposes usernames, email addresses, IP addresses, and activity data. The post Flickr Security Incident Tied to Third-Party Email System appeared first on SecurityWeek . ", "topic": "general", "time": 1770381647}, {"title": "Sanctioned Bulletproof Host Linked to Hijacking of Old Home Routers", "text": "Compromised home routers in 30+ countries had DNS traffic redirected, sending users to malicious sites while normal browsing appeared unaffected. ", "topic": "general", "time": 1770381651}, {"title": "Ransomware Gang Goes Full 'Godfather' With Cartel", "text": "DragonForce is taking cues from organized crime, emphasizing cooperation and coordination among ransomware gangs. ", "topic": "ransomware", "time": 1770381655}, {"title": "Flickr discloses potential data breach exposing users' names, emails", "text": "Photo-sharing platform Flickr is notifying users of a potential data breach after a vulnerability at a third-party email service provider exposed their real names, email addresses, IP addresses, and account activity. [...] ", "topic": "breach", "time": 1770391982}, {"title": "CISA orders federal agencies to replace end-of-life edge devices", "text": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued a new binding operational directive requiring federal agencies to identify and remove network edge devices that no longer receive security updates from manufacturers. [...] ", "topic": "patch", "time": 1770391986}, {"title": "New Technical Markers Reveal Expanding ShadowSyndicate Cybercriminal Infrastructure", "text": "ShadowSyndicate cluster expands with new SSH fingerprints connecting servers to other ransomware ops ", "topic": "ransomware", "time": 1770403072}, {"title": "Apple Pay phish uses fake support calls to steal payment details", "text": "This Apple Pay phishing campaign is designed to funnel victims into fake Apple Support calls, where scammers steal payment details. It started with an email that looked boringly familiar: Apple logo, a clean layout, and a subject line designed to make the target’s stomach drop. The message claimed Apple has stopped a high‑value Apple Pay charge at an Apple Store, complete with a case ID, timestamp, and a warning that the account could be at risk if the target doesn’t respond.​ In some cases, there was even an “appointment” booked on their behalf to “review fraudulent activity,” plus a phone number they should call immediately if the time didn’t work.​ Nothing in the email screams amateur. The display name appears to be Apple, the formatting closely matches real receipts, and the language hits all the right anxiety buttons. This is how most users are lured in by a recent Apple Pay phishing campaign . The call that feels like real support The email warns recipients not to Apple Pay until", "topic": "apt", "time": 1770445972}], "recent_topics": ["ransomware", "apt", "ddos", "phishing", "vulnerability", "ddos", "apt", "general", "general", "general", "ransomware", "breach", "patch", "ransomware", "apt"]}